# #if案例 完成B站登录功能的实现(正确账号和密码: 159753/666888)
# #1 正确的账号和密码
# ok_ID = "159753"
# ok_password = "666888"
#
# #2 接收用户的账号和密码
# ID = input("请输入B站的账号: ")
# password = input("请输入B站的密码: ")
#
# #3 判断用户的账号密码是否全部正确,如果都正确,则登录成功,进入B站首页
# if ID == ok_ID and password == ok_password:
#     print("登录成功,欢迎少爷回来~")
#     print("进入B站首页")
#
# #4 判断用户的账号密码是否有误,如果有任何一个错误,则登录失败,提示错误信息
# else:
#     print("登录失败")
#     print("账号或密码有误")

# #练习
# #1 根据用户输入的数字，判断该数字是奇数还是偶数。
# num = int(input("请输入一个整数: "))
# if num % 2 == 0:
#     print(f"{num} 为偶数")
# else:
#     print(f"{num} 为奇数")
#
# #2.根据用户输入的年龄，判断该用户是否已经成年(>=18，成年;否则，未成年)。
# age = int(input("请输入你的年龄: "))
# if age >= 18:
#     print(f"{age}岁, 你已成年")
# else:
#     print(f"{age}岁, 还未成年")

#3.:根据用户输入的数字，判断该数字是正数还是负数或者是0。
# num = int(input("请输入一个数字: "))
# if num > 0:
#     print(f"{num} 为一个正数")
# elif num < 0:
#     print(f"{num} 为一个负数")
# else:
#     print(f"{num} 为0")

# #4.:根据用户输入的考试分数，判断该分数是否及格了(大于等于60就是及格了)
# num = float(input("请输入你的成绩: "))
# if num >= 60:
#     print(f"{num}分, 恭喜你已经及格")
# else:
#     print(f"{num}分, 很可惜,你不及格, 仍需努力")

#1.根据输入的考试成绩，判断成绩等级。大于等于85分为优秀, 60-85分为及格否则就是不及格
# num = float(input("请输入你的考试成绩: "))
# if num >= 85:
#     print(f"{num}分, 优秀")
# elif num >= 60:
#     print(f"{num}分, 及格")
# else:
#     print(f"{num}分, 不及格")

#2.购物折扣计算:根据输入的购物车的商品总额，以及如下的折扣规则，计算实际应付的金额。金额>=500:8折,  300<=金额<500:9折, 100 <=金额<300:95折, 金额〈100:无折扣
# amount = float(input("请输入购物车的商品总额:"))
#
# if amount >= 500:
#     pay = amount * 0.8
# elif amount >= 300:
#     pay = amount * 0.9
# elif amount >= 100:
#     pay = amount * 0.95
# else:
#     pay = amount
#
# print(f"实际付款金额为:{pay}元")

#三角形类型判断:根据输入的三个边的边长(正整数)，判定是等边三角形、等腰三角形、普通三角形，还是不能构成三角形。
# #案例构成三角形的条件:两边之和大于第三边
#三角形判定规则:
#三个边都相等:等边三角形
#两个边相等:等腰三角形
#三个边都不相等:普通三角形


"""北京市居民年度用电电费计算:根据输入的用电度数，计算电费
北京市居民电费采用阶梯电价计价方式，所谓阶梯电价是指按照用户消费的电量分段定价，用电价格随用电量增加
呈阶梯状逐级递增的一种电价定价机制。
阶梯电价规则:
第一档:2880度以下，电费单价0.4883元/度
第二档:2880-4800度，电费单价0.5383元/度
第三档:4800度以上，电费单价0.7883元/度
"""
# a = float(input("请输入您的用电度数为: "))
# if a < 2880:
#     pay = a * 0.4883
# elif a <= 4800:
#     pay = a * 0.5383
# else:
#     pay = a * 0.7883
# print(f"(您的实际缴费金额为: {pay}元)")